<?php

return [
    'global' => [
        'brand' => 'تعلم لتكسب',
        'email' => 'البريد الالكتروني',
        'email_placeholder' => 'أدخل بريدك الإلكتروني',
        'password' => 'كلمة المرور',
        'password_placeholder' => 'أدخل كلمة المرور',
        'send' => 'ارسال',
        'logout' => 'تسجيل الخروج',
    ],
    'login' => [
        'welcome' => 'أهلاً بعودتك!',
        'subtitle' => 'يرجى تسجيل الدخول للمتابعة.',
        'remember' => 'تذكرني',
        'submit' => 'تسجيل الدخول',
        'forgot_password' => 'نسيت كلمة المرور؟ اضغط هنا',
        'login_success' => 'تم تسجيل الدخول بنجاح',
    ],
    'forgot_password' => [
        'title' => 'نسيت كلمة المرور!',
        'subtitle' => 'لا داعي للقلق, أدخل البريد الالكتروني',
    ],
    'reset_password' => [
        'welcome' => 'أهلاً بعودتك!',
        'title' => 'اعادة تعيين كلمة المرور',
        'new_password' => 'كلمة مرور جديدة',
        'password_confirmation' => 'تأكيد كلمة المرور',
        'confirm_error' => 'كلمة السر والتأكيد غي متطابقتين',
        'reset' => 'اعادة تعيين',
        'message' => [
            'subject' => 'اعادة تعيين كلمة المرور',
            'body' => 'انت تتلفى هذا الايميل بناء على طلب وصلنا لمحاولة اعادة تعيين كلمة المرور.',
            'action' => 'أعد تعيين كلمة المرور',
            'footer' => 'اذا لم تقم بطلب اعادة تعيين كلمة المرور, فقط لا تقم بأي شئ.',
        ],
    ],
    'verify_email' => [
        'title' => 'تحقق من بريدك الإلكتروني',
        'subtitle' => 'شكراً لتسجيلك! قبل البدء، يرجى تفعيل بريدك الإلكتروني من خلال الضغط على الرابط الذي أرسلناه إليك للتو.',
        'sent' => 'تم الإرسال!',
        'sent_description' => 'تم إرسال رابط تفعيل جديد إلى بريدك الإلكتروني.',
        'resend' => 'إعادة إرسال بريد التفعيل',

        'message' => [
            'subject' => 'تفعيل البريد الإلكتروني لحساب المشرف',
            'body' => 'يرجى الضغط على الزر أدناه لتفعيل بريدك الإلكتروني.',
            'action' => 'تفعيل البريد الإلكتروني',
            'footer' => 'إذا لم تقم بإنشاء حساب، فلا داعي لاتخاذ أي إجراء آخر.',
        ],
    ],
];
